In [2]:
import numpy as np 
import pandas as pd 
from pandas import Series, DataFrame
from numpy.random import randn

In [3]:
# Let's make a dframe

dframe1 = DataFrame({'key':['X','Z','Y','Z','X','X'],
                     'data_set_1': np.arange(6)})
dframe1

   data_set_1 key
0           0   X
1           1   Z
2           2   Y
3           3   Z
4           4   X
5           5   X

In [4]:
dframe2 = DataFrame({'key':['Q','Y','Z'],
                     'data_set_2':[1,2,3]})
dframe2

   data_set_2 key
0           1   Q
1           2   Y
2           3   Z

In [5]:
pd.merge(dframe1,dframe2)

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2

In [6]:
pd.merge(dframe1,dframe2, on='key')

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2

In [7]:
pd.merge(dframe1,dframe2,on='key',how='left')

   data_set_1 key  data_set_2
0           0   X         NaN
1           1   Z           3
2           2   Y           2
3           3   Z           3
4           4   X         NaN
5           5   X         NaN

In [13]:
dframe2

   data_set_2 key
0           1   Q
1           2   Y
2           3   Z

In [14]:
# X keys are empty this is why it calls NaN

In [10]:
pd.merge(dframe1,dframe2, on='key', how='right')

   data_set_1 key  data_set_2
0           1   Z           3
1           3   Z           3
2           2   Y           2
3         NaN   Q           1

In [12]:
pd.merge(dframe1,dframe2, on='key', how='left')

   data_set_1 key  data_set_2
0           0   X         NaN
1           1   Z           3
2           2   Y           2
3           3   Z           3
4           4   X         NaN
5           5   X         NaN

In [15]:
pd.merge(dframe1,dframe2, on='key', how='outer')

   data_set_1 key  data_set_2
0           0   X         NaN
1           4   X         NaN
2           5   X         NaN
3           1   Z           3
4           3   Z           3
5           2   Y           2
6         NaN   Q           1

In [16]:
dframe3 = DataFrame({'key':['x','x','y','y','z','z'], 'data-set:3':range(6)})
dframe4 = DataFrame({'key':['y','y','x','x','z'], 'data-set:4':range(5)})

dframe3 
dframe4

   data-set:4 key
0           0   y
1           1   y
2           2   x
3           3   x
4           4   z

In [17]:
dframe3

   data-set:3 key
0           0   x
1           1   x
2           2   y
3           3   y
4           4   z
5           5   z

In [18]:
pd.merge(dframe3,dframe4)

   data-set:3 key  data-set:4
0           0   x           2
1           0   x           3
2           1   x           2
3           1   x           3
4           2   y           0
5           2   y           1
6           3   y           0
7           3   y           1
8           4   z           4
9           5   z           4

In [21]:
df_left = DataFrame({'key1':['Izmir','Izmir','Istanbul'],
                     'key2':['bir','iki','uc'],
                     'sol_data':[10,20,30]})
df_right = DataFrame({'key1':['Istanbul','Izmir','Istanbul','Izmir'],
                     'key2':['bir','bir','uc','bir'],
                     'sol_data':[40,50,60,70]})

In [22]:
df_left

       key1 key2  sol_data
0     Izmir  bir        10
1     Izmir  iki        20
2  Istanbul   uc        30

In [23]:
df_right

       key1 key2  sol_data
0  Istanbul  bir        40
1     Izmir  bir        50
2  Istanbul   uc        60
3     Izmir  bir        70

In [24]:
pd.merge(df_left,df_right,on=['key1','key2'],how='outer')

       key1 key2  sol_data_x  sol_data_y
0     Izmir  bir          10          50
1     Izmir  bir          10          70
2     Izmir  iki          20         NaN
3  Istanbul   uc          30          60
4  Istanbul  bir         NaN          40

In [26]:
pd.merge(df_left,df_right, on='key1')

       key1 key2_x  sol_data_x key2_y  sol_data_y
0     Izmir    bir          10    bir          50
1     Izmir    bir          10    bir          70
2     Izmir    iki          20    bir          50
3     Izmir    iki          20    bir          70
4  Istanbul     uc          30    bir          40
5  Istanbul     uc          30     uc          60

In [27]:
# For more info on merge parameters check out:
url = 'http://pandas.pydata.org/pandas-docs/dev/generated/pandas.DataFrame.merge.html'

# Next we'll learn how to merge on Index!